---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.StairsTopLowerThanBaseFailure
source: html/ba4e0449-5ec3-a9f8-61be-19d3c6d15fd8.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.StairsTopLowerThanBaseFailure Property

The top of the Stair is lower than the base of the Stair

## Syntax (C#)
```csharp
public static FailureDefinitionId StairsTopLowerThanBaseFailure { get; }
```